---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolLocation
source: html/e7985abd-f4b5-aad3-13e2-4b17354fe52c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolLocation Property

"Diameter Symbol Location"

## Syntax (C#)
```csharp
public static ForgeTypeId DiameterSymbolLocation { get; }
```